<template>
  <div>
    <van-sticky>
      <van-row class="bgset" style="width:100%;height:50px;" >
        <van-col span="24"  >
          <van-nav-bar
            left-text="返回"
            left-arrow
            @click-left="back">

          </van-nav-bar>
        </van-col>
      </van-row>
    </van-sticky>
    <p class="tle">{{list.title}}</p>
    <p style="text-align: right;font-size: 12px;height: 12px">{{list.mname}} </p>
    <van-swipe  :autoplay="3000" indicator-color="white" style="height: 200px;">
      <van-swipe-item v-for="(item, index) in list.nimg" :key="index">
        <img :src=item style="width:100%;height:200px;" />
      </van-swipe-item>
    </van-swipe>

    <div  v-for="item in splittext(changeLine(list.content))">
      <p  class="maintext" v-html="item" ></p>
    </div>

    <p style="text-align: right;font-size: 14px">{{list.ntime}}<br>{{list.publisher}}<br>{{list.source}}</p>



  </div>
</template>

<script>
  export default {
    name: "newsdl2",
    data(){
      return{
        list:{nid:1,
          title:"未完成的梦",
          content:"以下内容为中国地质博物馆岩石矿物研究室李宏博演讲实录：\n大家好，我是李宏博，来自中国地质博物馆。我是一名地质工作者，今天我和大家一起走进一桩发生在亿万年前的“地质大案”。\n当然了，我们讲的这个“大案”并不是一般意义上的案件，它指的是在地球历史中发生的一次大事件。咱们这桩“地质大案”还要从\n说起。\n我们先把时间回到89年前，那是1929年冬的一天，著名的地质学家赵亚曾先生正在我国西南地区进行地质考察，这一晚他就在一家小客栈里休息。\n想不到一伙土匪破门而入，见赵先生身边有只箱子，就不由分说地上来抢夺，赵先生拼命地护着箱子。这伙凶恶的土匪见状就更加确信这箱子里肯定有值钱的宝贝，竟然一不做二不休把赵先生杀害了，可怜我们这位痴迷学术、才华横溢的地质学奇才殉难时年仅31岁。\n赵先生的箱子里到底装的是什么宝贝？\n这些岩石是宝石吗？不是，就是普通的岩石，但是这些岩石却与我们今天所讲的这桩“地质大案”有很大关系。\n这些岩石是赵先生在峨眉山采集的玄武岩，在这里赵先生首先发现了一套玄武岩地层，并把它命名为“峨眉山玄武岩”。而“峨眉山玄武岩”正是我们今天讲的这桩“地质大案”的重要线索。\n玄武岩是一种火山岩，就是由基性岩浆喷发、冷凝形成的一种岩石，\n可能连赵先生自己也没有想到，他的这个发现只是揭开了冰山一角。在后来的地质调查中，我们逐渐发现这套玄武岩地层不仅在峨眉山这一个地区有分布，而是遍布我国整个西南地区。\n这张图是目前为止发现的峨眉山玄武岩的分布情况，它的面积超过50万平方公里，大致相当于法国的国土面积。\n通过放射性同位素测年的方法，我们确定这些玄武岩是在两亿六千万年前形成的，也就是古生代二叠纪的末期。我们在西南地区发现了大面积的玄武岩，意味着两亿六千年前，在这里曾经发生过一场规模巨大的火山喷发事件，就是我们今天要讲的“地质大案”。\n发生了这么大的案子，我们一定要到现场考察。大家可能会问，这么大的范围你跑得过来吗？图上的点，就是我本人以及我们团队的成员曾经考察过的地方，可以说我们跑遍了西南地区的山山水水。\n下面我们一起到野外看一看，了解一些有趣的地质现象。\n这张照片是在贵州水城拍摄的，可以看到一根一根紧密排列的石柱，这就是最典型的玄武岩的柱状节理。大家再仔细看，这些石柱正在向上汇聚，这是一个典型的古火山口。\n这张照片是在贵州盘县拍摄的，整个山体都是由峨眉山玄武岩构成的。我们站在山脚下仰望这座山的时候，感觉这座山特别雄伟挺拔，大家有没有发现什么特别的地方？\n这些玄武岩都是一层一层的，层层叠叠的，为什么会形成这种现象呢？其实这跟摊煎饼挺像的，火山喷发一次，岩浆在大地上流淌就形成一层，又喷发一次就又会形成一层，一层层的玄武岩堆叠起来就形成了这种现象，所以地质工作者也把这种现象形象地称为“\n”。\n这张照片是在云南宾川拍摄的，这张照片上的玄武岩跟前面的都不太一样，一个个都是圆滚滚的，像咱们家里的抱枕似的。\n这种玄武岩我们称之为“枕状玄武岩”，这是岩浆在水下喷发时所形成的一种独特的岩石构造。\n我们通过野外调查，进一步确定，2.6亿年前我国的西南地区的确发生过一次大规模的火山喷发事件。在这个大案中谁是受害者？\n在揭开这个谜题之间我先请大家看一段视频，感受火山和岩浆的威力。\n这段视频是两个地质学家拍摄的珍贵资料，非常近距离地记录了火山喷发的情况。火山的岩浆是高温的，还有大量的火山灰释放出来，近距离靠近的时候一定要穿上防护服。\n在大家的印象中，岩浆是不是应该静静地流淌？其实岩浆可以像洪水一样地奔流。这两位地质学家也在一次由火山喷发引发的时速高达160公里的火山碎屑流中献出了他们的生命。这种火山碎屑流的温度高达400多摄氏度。\n请问大家看完视频之后有什么感受？是不是觉得火山喷发的后果很严重？其实这只是小case，因为火山喷发还会引发生物灭绝惨案。\n最近《侏罗纪世界》在热映，在这部影片里恐龙生活的努布拉岛上的火山发生了强烈的喷发，很多恐龙都葬身火海。\n影片里的一幕让我印象非常深刻，有一只硕大的腕龙跑到海边，却已经无路可逃，从它身后袭来高温的火山灰把它包围，瞬间化成了灰烬，像恐龙这么强大的生物在火山喷发面前也是毫无抵抗力的。\n火山喷发为什么有这么大的威力？我们来看看它有哪些大杀器。首先就是\n，岩浆是温度最高可达1300摄氏度，所以说岩浆流过的地方一定是寸草不生。\n火山还会释放出\n，对大气系统产生严重影响。第三大杀器就是\n，火山强烈的喷发会把大量的火山灰抛入大气层，从而进入大气环流，这些遮天蔽日的火山灰会引发像核冬天一样的灾难。\n恐龙灭绝是一次惨案，但它还不是最惨的一次。在地球历史上最大的一次生物灭绝发生在二叠纪末期，在这次生物大灭绝中，海洋中的生物物种有90%灭绝了，陆地上的生物物种也有70%彻底消失。\n图中的这种生物——“三叶虫”曾经在地球上极度繁盛，但正是在这次二叠纪末期的生物大灭绝中彻底消失了。\n我们前面讲过，在西南地区发现的这些大面积的峨眉山玄武岩所代表的大规模的火山喷发事件发生在二叠纪末期，它的时间和地球历史上这次最大的生物灭绝事件的时间基本吻合。所以有学者提出，很可能是这次大规模的火山喷发事件导致了这次生物灭绝。\n大家可以想象一下，五十万平方公里的面积上发生火山强烈喷发，就如同目前全球所有的活火山同时喷发一样，火山的三大“杀器”的威力就会呈几何级数般的扩大，必然会对全球的生态系统造成毁灭性的打击。\n现在“地质大案”的案情比较清楚了，就是说\n现在摆在我们地质工作者面前的问题是：谁是导致这次大规模火山喷发的真正力量？经过一番调查和研究，我们锁定了三位“嫌疑人”，这三个嫌疑人代表了三种不同的构造环境，在其中都会引发大规模的火山喷发、形成玄武岩。\n第一个嫌疑人叫\n，什么是岛弧呢？地球的地壳是由板块组成的，但这些板块很不老实，它们之间经常摩擦碰撞，两个板块碰在一起的时候，其中的一个板块就会俯冲到另一个板块下面。这种强烈的碰撞、俯冲作用就会引发火山、地震等地质活动，火山喷发还会形成一连串呈线状展布的弧形海岛，这就是岛弧。\n地球上最典型的岛弧就是西太平洋岛弧，它的北段由千岛群岛、日本列岛、琉球群岛和菲律宾群岛组成。我们经常在新闻中看到我国的空军、海军突破了第一岛链，第一岛链指的就是西太平洋岛弧，它是太平洋板块向欧亚板块俯冲的产物。\n这里也是地震火山的多发地带，前几天日本的大坂发生了里氏6.1级的地震，可见这里地质活动之强烈，这里也会有大量的火山和玄武岩形成，所以说岛弧是嫌疑人之一。\n第二嫌疑人是\n，也叫中央海岭，它贯穿全球大洋，长度达到了八万四千公里，相当于绕地球赤道两圈多。\n这里有非常活跃的岩浆作用，源自上地幔的岩浆在这里喷发，形成的岩石主要是玄武岩。这里还是板块扩张的中心，也是新生板块的诞生地。所以大洋中脊也是我们的一个重点怀疑对象。\n第三嫌疑人的名字叫\n，大家可能比较陌生，但是大家对著名的度假胜地夏威夷一定很熟悉，夏威夷群岛是由一系列的火山岛组成的，这些火山岛主要由玄武岩组成。\n地质学家研究夏威夷群岛的形成时，发现了一个十分有趣的现象，这些火山岛的年龄是逐渐变年轻的。\n为了解释这种地质现象，地质学家提出了一个热点理论，热点就是从地幔深处升起的一个热柱，它会引发火山喷发和岩浆作用。当漂移的板块经过这个相对固定的热点之上时，热点间歇性的火山喷发，就形成了一串火山岛。\n热点理论比较好地解释了夏威夷群岛的形成，在此基础上，地质学家提出了地幔柱理论。地幔柱就是一个超大号的热点，现在的研究认为，地幔柱起源于地幔的深部，甚至达到了地核和下地幔的边界。\n左边这张图就是地质学家通过计算机模拟出来的地幔柱，从核幔边界升腾而起。当它到达岩石圈地幔的底部，它就扩展成一个直径达千公里级的蘑菇状的头部，从而引发强烈的岩浆作用和火山喷发。\n原子弹爆炸形成的蘑菇云是不是跟它有点像？地幔柱的威力非常大，地幔柱也是一个“嫌疑人”。\n我们已经锁定了三位嫌疑人，下面该揪出真凶了。地质学家找到了一个破案神器，它叫稀土元素（Rare Earth Element, REE），稀土元素是由十五种地球化学性质相近的元素组成的，在岩石中的含量很少，属于微量元素。\n而研究表明，在岛弧、大洋中脊、地幔柱这三种不同的构造环境中所形成的玄武岩的稀土元素含量分布模式曲线是截然不同的，这就为我们破案找到了突破口。\n我们把从野外采回来的样品进行分析，然后把样品的稀土元素分布模式曲线投在这张图上进行对比。我们发现峨眉山玄武岩的稀土元素分布模式曲线和岛弧、大洋中脊完全不同，而和地幔柱完全吻合，这样我们就排除了大洋中脊和岛弧的嫌疑，锁定了真凶，它就是地幔柱。\n我们现在可以为这场发生在2.6亿年前的“地质大案”做一个结案陈词了。我们在我国的西南地区发现了大面积的玄武岩，从而确定了这场大案的性质是一次发生在2.6亿年前的大规模火山喷发事件，而这个火山喷发事件很可能导致了一次地球历史上规模最大的生物灭绝惨案，我们通过调查与分析，最终揪出了真凶，它就是地幔柱。\n这桩“地质大案”讲完了，但我还要做两点补充说明。首先我要为火山和岩浆做一个小小的辩护，\n。\n这次2.6亿年前的大规模火山喷发事件在我们西南地区形成了很多金属矿床，其中最著名的就是攀枝花超大型钒钛磁铁铁矿矿床，有世界钒钛之都的美誉，这里是我国主要的钒钛产品以及重要的钢铁生产基地，为我国的经济建设做出了很大贡献。所以我们不能只看到火山喷发给我们带来的灾难，也要看到它给我们带来的好处。\n我要说的第二点是，其实这件地质大案并没有真正结案，因为\n。比如我们今天讲的地幔柱理论，也一直在不断地发展和完善中。\n所以我希望大家，尤其是在座的青少年朋友，也加入到地质探索中来，一起去寻找证据，破解那些地质之谜。最后我要为中国地质博物馆打call，欢迎大家到中国地质博物馆参观，走进神奇的地质世界，谢谢大家。",

          nimg:['http://c.hiphotos.baidu.com/baike/pic/item/5882b2b7d0a20cf4035ff0bb72094b36adaf9982.jpg',
            'http://img.sanhao.com/community_news/3278/20160730144309165.jpg',
            'http://www.dugoogle.com/uploads/allimg/171103/6_171103182332_1.jpg',],
          ntime:"1999.06",
          publisher:"搜狐网",
          mname:"军事博物馆",
          evaluation:"还不错",
          source:"百度",
        },
        id:0,
        mname:"",

      }
    },
    created() {
      this.getid();
      this.getlist();
    },

    methods:{
      back(){this.$router.back()},
      changeLine(str){
        return str.replace(/\n|\r\n/g,"<br/>");
      },
      splittext(text){
        return text.split("<br/>");
      },
      getid(){
        this.mname = this.$route.params.mname
      },
      getlist(){
        var _self=this;
        console.log(111)
        this.$http.get("http://localhost:8989/imsub/News/findByname",this.mname).then((response) => {
          _self.list=response.data.result
          console.log(_self.list)
        })
      },
    }

  }
</script>

<style scoped>
  .tle{
    font-weight:bold;
    font-weight:800;
    font-size: 20px;
    height: 15px;
  }
  .maintext{
    text-align: left;
    white-space: pre-wrap;
    text-indent: 2em;
    line-height: 1.8em;

  }

</style>
