<template>
<div>
  <!--新闻显示-->
  <van-list
    v-model="loading"
    :finished="finished"
    finished-text="没有更多了"
    @load="onLoad"
  >
    <li v-for="item in list" class="list-item" >
      <news v-bind:nums="item"></news>
    </li>

  </van-list>
</div>
</template>

<script>
    export default {
        name: "newview",
      data(){
          return{
            loading: false,
            finished: false,
            list:  ["【湖北省博物馆、考古所推出原创歌曲《文博战“疫” 黄鹤迎春》】文博战“疫”，黄鹤归来，武汉重启，春暖花开。日前，湖北省博物馆、湖北省文物考古研究所推出原创歌曲《文博战“疫” 黄鹤迎春》，向关心、支持、援助、参与文博系统武汉战“疫”的各级领导、各个单位、各界人士致敬。",
              "【无锡博物院发布恢复开放2号公告】4月7日（周二）起无锡博物院进一步恢复开放，开放范围扩大至无锡博物院东区科技展厅，并增开西负一观众入场通道。疫情防控期间，观众参观须出示本人身份证，核验个人“锡康码”，显示绿色方可入馆，其余防控措施仍按无锡博物院恢复开放公告执行。",
              "【杭州历史建筑启动三维测绘建档】历史建筑作为历史文化的重要载体，是彰显文化自信和城市归属感的重要手段，也是杭州的重要使命。日前，杭州首次利用三维激光扫描、倾斜摄影、全景影像采集等技术，针对斗富二桥33号建筑、华丰纸业办公楼等杭州市历史建筑进行了三维测绘建档，开启数字化保护的新篇章。杭州市历史建筑保护管理中心高级工程师楼舒说，与传统测绘方式相比，数字化测绘建档具有“三高”的技术优势——效率高、精度高、完整度高。据了解，目前，杭州市正逐步建立历史建筑信息化管理系统，用于历史建筑定位和编号、名称、地址等基础信息的查询、统计等，该系统将为今后历史建筑活化利用提供技术保障，为弘扬传承历史文脉开辟出一条新道路。",
              "【温州发现宋代“萧家渡”遗址　内有两方清朝古碑】近日，浙江省温州市平阳县萧江镇潘家汇村发现一古渡亭遗址，遗址内保留有刻于清代乾隆、道光年间的两方古碑等遗物。据碑文记载，该渡亭所处位置为宋人萧振造大舟济渡行人的义渡渡口。二十世纪六十年代横阳支江改道，加之公路交通日益发达，该渡口便废弃不用。该渡亭遗址位于萧江镇潘家汇村东面，整个遗址杂草丛生，面积约七十多平方米，尚留有亭基残垣、七八根方形石柱，以及两方分别刻于清朝乾隆五十七年(1792)和道光八年(1828)的石碑，嵌立在断墙残垣中。除了两方石碑留有文字记载，矗立于亭址的石柱上也镌刻有“淋头姜蒋助石柱八根”等捐助信息。",
              "【中国】宝龙美术馆：4月24日，宝龙美术馆将举办展览 “远山：汪一个展”。本次展览展品以艺术家汪一在西藏、云南和北美的旅行经历为创作灵感，用一种过客的视角，记录了旅行途中的见闻。本次展览将着重强调艺术家创作理念中他者的概念，带人逃离世俗纷扰，重塑乌托邦，探索自身的存在，而这种“闯入”的方式，以他者之眼看异域文化，也让画面奇妙地灵动起来。本次展览将于5月10日结束。\n" +
              "\n",
              "【中国】江宁织造博物馆：目前，“来自盛京：清代宫廷生活艺术展”正在江宁织造博物馆进行展出。 沈阳故宫是中国现存最完整的两座皇家宫殿建筑群之一，始建于后金天命十年（1625），是清入关前努尔哈赤、皇太极两代帝王兴建和使用的“盛京皇宫”；1644年清迁都北京后，被尊为“陪都宫殿”，亦是康熙、乾隆、嘉庆、道光等帝东巡盛京时驻跸的行宫。本次展览通过沈阳故宫博物院珍藏的95件（套）精品文物，讲述清代皇室宫廷生活中的礼制与意趣，以此向观众展示清代皇家历史文化和文物精粹，引导观众探寻满族皇室的龙兴之路。",
              "【中国】济南市博物馆：“天工开物 匠心独运——济南市博物馆藏木雕珍品展”正在济南市博物馆面向全体观众开放。展览遴选济南市博物馆藏明清至中华民国时期木雕艺术精品48件（套），展览内容丰富，展品格调高雅，向泉城市民及游客充分展示了中国古代精湛的木雕技艺与文化。本次展览将于6月底结束。",
              "【河北邢台发现4座古代墓葬】4月8日，河北邢台市考古人员在广宗县广宗镇大王村发现四座古墓，经现场专家勘察，古墓内砖雕保存完好，样式精美。目前，考古人员正在进行抢救性挖掘。据介绍，根据墓葬的形制初步推断，墓主大约葬于北宋初期，距今1000多年。",
              "【中国】海南省博物馆：4月8日，“‘琼’尽全力—海南战‘疫’特展”在海南省博物馆拉开帷幕。此次展览是该博物馆恢复开放后的首个落地展览，从社会各界捐赠的300余件（套）抗疫见证物中精心挑选了40余件（套）对外展出，内容分为“疫霾突起”“举岛驱霾”“拂开‘疫’霾”“战‘疫’记忆”四个板块。该展览集中展示了海南省在抗击新冠肺炎疫情战“疫”中，全省人民团结一心、同舟共济的精神风貌。本次展览将于5月8日结束。",
              "【中国】良渚博物院：4月11日，良渚博物院将开展“‘钺’下良语”主题云直播。钺，由斧演变而来，象征权力与威严。良渚文化中的组合式玉钺，是王的权杖，体现了王权神授。反山十二号墓出土的玉钺，是迄今为止唯一雕琢有神人兽面纹和鸟纹的玉钺，堪称“钺王”。在本次直播中，良渚博物院讲解员单晴娟将为观众讲述良渚玉钺的精彩故事。"]
          }
      },
      methods:{
        onLoad() {
          // 异步更新数据
          // setTimeout 仅做示例，真实场景中一般为 ajax 请求
          setTimeout(() => {
            for (let i = 0; i <0; i++) {
              this.list.push(this.list.length + 1);
            }

            // 加载状态结束
            this.loading = false;

            // 数据全部加载完成
            if (this.list.length >=10) {
              this.finished = true;
            }
          }, 1000);
        }
      }

    }
</script>

<style scoped>

</style>
